<?php
$lang['friendlyname'] = 'Галерея';
$lang['moddescription'] = 'Если другие мнения нужно подавлять силой, то, вероятно, правда не на вашей стороне';
$lang['description'] = 'Если другие мнения нужно подавлять силой, то, вероятно, правда не на вашей стороне';
$lang['postinstall'] = 'Модуль &quot;Галерея&quot; успешно установлен.';
$lang['tinymce_description_picker'] = 'Позволяет простую вставку фотогалерей.';
$lang['tinymce_button_picker'] = 'Добавить галерею';
$lang['active'] = 'Активен';
$lang['apply'] = 'Применить';
$lang['areyousure'] = 'Вы действительно хотите удалить?';
$lang['areyousuremulti'] = 'Вы действительно хотите выполнить эту длительную операцию?';
$lang['cancel'] = 'Отмена';
$lang['copy'] = 'Копировать';
$lang['default'] = 'По умолчанию';
$lang['delete'] = 'Удалить';
$lang['down'] = 'Вниз';
$lang['edit'] = 'Редактировать';
$lang['error'] = 'Ошибка!';
$lang['inactive'] = 'Неактивно';
$lang['setfalse'] = 'Установить &quot;False&quot;';
$lang['settrue'] = 'Установить &quot;True&quot;';
$lang['submit'] = 'Сохранить';
$lang['up'] = 'Вверх';
$lang['gallerymenu'] = 'Меню Галереи';
$lang['galleries'] = 'Галереи';
$lang['gallerypath'] = 'Галерея';
$lang['dirtag'] = 'Тэг для показа субгалереи';
$lang['editgallery'] = 'Редактировать галерею';
$lang['addsubgallery'] = 'Добавить субгалерею';
$lang['uploadimages'] = 'Загрузка изображений';
$lang['editimage'] = 'Редактировать свойства изображения';
$lang['editthumbs'] = 'Редактировать миниаютюры';
$lang['nogalleriestext'] = 'Нет доступных галерей';
$lang['list'] = 'Список';
$lang['item'] = 'Изображение';
$lang['title'] = 'Заголовок';
$lang['date'] = 'Дата';
$lang['nofilestext'] = 'Нет изображений';
$lang['directoryname'] = 'Новое имя папки';
$lang['gallerytitle'] = 'Заголовок галереи';
$lang['comment'] = 'Комментарий';
$lang['albumcover'] = 'Обложка альбома';
$lang['noalbumcover'] = 'Субгалерея не имеет изображения-эскиза (&quot;обложки альбома&quot;)';
$lang['template'] = 'Шаблон';
$lang['editors'] = 'Редакторы';
$lang['parentgallery'] = 'Родительская галерея';
$lang['hideparentlink'] = 'Скрыть ссылку на родительскую галерею';
$lang['usedefault'] = 'по умолчанию';
$lang['sortbysettings'] = 'Сортировать согласно настройкам шаблона';
$lang['sureunsort'] = 'Вы уверены что хотите удалить порядок сортировки установленный вручную?';
$lang['updatethumbs'] = 'Обновить эскизы';
$lang['sureupdatethumbs'] = 'Вы уверены, что вы хотите удалить эскизы?';
$lang['thumbsrecreated'] = 'Они будут пересозданы при первом посещении галереи';
$lang['thumbsdeleted'] = 'Эскизы удалены.';
$lang['galleryupdated'] = 'Галерея была успешно обновлена.';
$lang['withselected'] = 'С выделенными';
$lang['moveto'] = 'Переместить в';
$lang['imageupdated'] = 'Свойства изображения обновлены';
$lang['imagedetailsupdated'] = 'Детали изображения обновлены.';
$lang['thumbupdated'] = 'Миниатюра обновлена.';
$lang['error_insufficientparams'] = 'Недостаточно параметров.';
$lang['error_updategalleryfailed'] = 'бновление галереи завершилось неудачей.';
$lang['error_directorynameinvalid'] = 'Некорректное имя папки.';
$lang['error_directoryalreadyexists'] = 'Папка с таким именем уже существует.';
$lang['templates'] = 'Шаблоны';
$lang['title_available_templates'] = 'Доступные шаблоны';
$lang['prompt_name'] = 'Имя';
$lang['prompt_version'] = 'Версия';
$lang['prompt_about'] = 'О модуле';
$lang['prompt_default'] = 'По умолчанию';
$lang['prompt_visible'] = 'Видим в списке шаблонов';
$lang['prompt_newtemplate'] = 'Создать новый шаблон';
$lang['makevisible'] = 'Сделать видимым в выпадающем списке шаблонов пользователям без прав \'Modify Templates\'';
$lang['makeinvisible'] = 'Сделать невидимым в выпадающем списке шаблонов пользователям без прав \'Modify Templates\'';
$lang['title_importxml'] = 'Импортировать шаблон из XML файла';
$lang['importxmlnote'] = 'XML файлы, содержащие различные шаблоны для модуля &quot;Галерея&quot;, можно найти на Module Forge <a href=&quot;http://dev.cmsmadesimple.org/project/files/726&quot; target=&quot;_blank&quot;>Gallery page</a>. Прочитайте примечания к выпуску перед загрузкой на сервер!';
$lang['importxml'] = 'Импортировать XML шаблон';
$lang['overwrite'] = 'Перезаписать существующие шаблоны модуля';
$lang['title_singleimg_template'] = 'Шаблон для вывода 1 изображения (параметр img)';
$lang['title_template'] = 'Редактор шаблона';
$lang['prompt_templatename'] = 'Имя шаблона';
$lang['thumbnailsize'] = 'Размер эскиза (Фронтенд)';
$lang['leaveempty'] = '(оставьте это пустым, чтобы использовать эскизы Менеджера изображений по умолчанию)';
$lang['width'] = 'ширина';
$lang['height'] = 'высота';
$lang['resizemethod'] = 'метод изменения размера';
$lang['crop'] = 'кадрирование';
$lang['scale'] = 'масштабирование';
$lang['zoomcrop'] = 'зум & кадрирование';
$lang['zoomscale'] = 'зум & масштабирование';
$lang['maxnumber'] = 'Максимальное количество элементов на странице';
$lang['showallimages'] = 'Если Вы оставите это пустым, все изображение будут показаны без ссылок';
$lang['sortingoptions'] = 'Настройки сортировки';
$lang['specifysortfields'] = 'Укажите поле (поля), по которым будут отсортированы элементы';
$lang['ascending'] = 'по возрастанию';
$lang['descending'] = 'по убыванию';
$lang['addfield'] = 'Добавить поле';
$lang['deletefield'] = 'Удалить последнее поле';
$lang['prompt_template'] = 'Шаблон';
$lang['prompt_templatecss'] = 'CSS шаблона';
$lang['prompt_templatejs'] = 'JavaScript шаблона';
$lang['jsposition'] = 'Куда вставить javascript';
$lang['jstop'] = 'в элементе head';
$lang['jsbtm'] = 'внизу элемента body';
$lang['resetoriginal'] = 'Сбросить к начальным настройкам';
$lang['resetoriginalwarning'] = 'Вы уверены, что хотите сбростиь код шаблона к его начальному значению?';
$lang['templateupdated'] = 'Шаблон был успешно обновлен.';
$lang['templateadded'] = 'Шаблон был успешно добавлен.';
$lang['error_templateexists'] = 'Шаблон модуля уже существует и не может быть перезаписан.';
$lang['error_directorynotwritable'] = 'Папка недоступна для записи.';
$lang['error_incompletexml'] = 'Неполный xml.';
$lang['error_cantcreatedir'] = 'Невозможно создать папку';
$lang['error_cantcreatefile'] = 'Невозможно создать файл';
$lang['templatedeleted'] = 'Шаблон удален';
$lang['availablevariables'] = 'Доступные Smarty-переменные шаблона';
$lang['availablevariableslist'] = 'Это переменные, которые вы можете использовать для модификации шаблона:<br /><br />
<code>{$module_message}</code> - сообщение об ошибке, переменная установлена только если существует сообщение<br />
<code>{$gallerytitle}</code> - заголовок галереи. Если нет заголовка, переменная содержит имя папки<br />
<code>{$gallerycomment}</code> - комментарий галереи<br />
<code>{$galleryid}</code> - уникальный id галереи<br />
<code>{$parentlink}</code> - текст ссылки на родительскую папку<br />
<code>{$parent_url}</code> - ссылка на родительскую папку<br />
<code>{$parent_txt}</code> - текст для создания ссылки на родительскую страницу<br />
<code>{$hideparentlink}</code> - да/нет<br />
<code>{$imagecount}</code> - показывает, к примеру, &quot;6 изображений&quot;, в зависимости от языка<br />
<code>{$itemcount}</code> - количество элементов: изображения + папки<br />
<code>{$pages}</code> - количество страниц<br />
<code>{$prevpage}</code> - ссылка на предыдущую страницу, если таковая существует<br />
<code>{$prevpage_url}</code> - url предыдущей страницы, если таковая существует<br />
<code>{$prevpage_txt}</code> - текст для ссылки на предыдущую страницу<br />
<code>{$nextpage}</code> - ссылка на следующую страницу, если таковая существует<br />
<code>{$nextpage_url}</code> - url следующей страницы, если таковая существует<br />
<code>{$nextpage_txt}</code> - текст для ссылки на следующую страницу<br />
<code>{$pagelinks}</code> - ссылки на каждую существующую страницу<br />
<code>{$images}</code> - массив с элементами:<br />
 - <code>file</code> - относительный путь к оригинальному изображению (или субгалереи)<br />
 - <code>title</code> - заголовок изображения. Если заголовка нет, содержит имя файла изображения<br />
 - <code>comment</code> - комментарий к изображению<br />
 - <code>filedate</code> - дата и время создания<br />
 - <code>thumb</code> - относительный путь к эскизу. В случае субгалереи этот элемент содержит изображение, которое установлено по умолчанию для субгалереи. Если никакое изображение не установлено по умолчанию, будет использована страндартная иконка папки.<br />
 - <code>fileid</code> - уникальный идентификатор для изображения или субгалереи<br />
 - <code>isdir</code> - true если это субгалерея<br />';
$lang['fielddefinitions'] = 'Определения поля';
$lang['fielddefinition'] = 'Определение поля';
$lang['addfielddef'] = 'Добавить определение поля';
$lang['editfielddef'] = 'Редактировать определение поля';
$lang['alias'] = 'Псевдоним';
$lang['type'] = 'Тип';
$lang['textinput'] = 'Text Input';
$lang['dropdown'] = 'Раскрывающийся список';
$lang['checkbox'] = 'Checkbox';
$lang['radiobuttons'] = 'Радио-кнопки';
$lang['textarea'] = 'Text Area';
$lang['wysiwyg'] = 'WYSIWYG';
$lang['file'] = 'Файл';
$lang['properties'] = 'Свойства поля';
$lang['properties_help'] = 'Максимальное количество символов для поля ввода текста или список значений, разделенных запятыми, для раскрывающегося поля или радиокнопок';
$lang['public'] = 'Public (сделать видимым для фронтенда)';
$lang['dirfield'] = 'Добавить поле к';
$lang['fielddefadded'] = 'Определение поля добавлено';
$lang['fielddefsupdated'] = 'Список определений обновлён';
$lang['options'] = 'Настройки';
$lang['urlprefix'] = 'Префикс добавляемый ко всем URL в модуле Gallery';
$lang['urlprefix_help'] = 'Используется только если включены ЧПУ(pretty urls) и через mod_rewrite и через internal pretty urls';
$lang['allowed_extensions'] = 'Разрешенные расширения';
$lang['maxsize'] = 'Перед загрузкой на сервер уменьшить изображения до этого максимального размера';
$lang['imagejpgquality'] = 'Качество изменения размера для больших изображений';
$lang['thumbjpgquality'] = 'Качество изменения размера миниатюр';
$lang['jpgquality_help'] = '(1 - 100)';
$lang['searchimages'] = 'Искать отдельные изображения вместо подгалерей';
$lang['use_permissions'] = 'Требовать право пользователя для редактирования подгалерей';
$lang['newgalleries_active'] = 'Новые галереи активны по умолчанию';
$lang['use_comment_wysiwyg'] = 'Использовать WYSIWYG редактор для поля &quot;комментарий&quot;';
$lang['editdirdates'] = 'Разрешить пользвателям редактировать дату создания субгалереи';
$lang['editfiledates'] = 'Разрешить редактирование даты изображений';
$lang['fe_folderpath'] = 'Путь к стандартному изображению папки для фронтенда';
$lang['be_folderpath'] = 'Пусть к стандартному изображению папки для админки';
$lang['optionsupdated'] = 'Настройки были успешно обновлены.';
$lang['rotateclockwise'] = 'Вращаться по часовой стрелке';
$lang['rotateanticlockwise'] = 'Повернуть против часовой стрелки';
$lang['editthumb_help'] = 'Щелкните и перетащите изображение, чтобы выбрать область';
$lang['thumb_current'] = 'Текущая миниатюра';
$lang['thumb_preview'] = 'Превью';
$lang['image'] = 'изображение';
$lang['images'] = 'изображения';
$lang['parent'] = 'Назат к родительской галерее';
$lang['prevpage'] = 'Предыдущий';
$lang['nextpage'] = 'Следующий';
$lang['defaultgallerycomment'] = 'Спасибо за установку модуля &quot;Галерея&quot;. Если вы загрузите изображения в папку \'uploads/images/Gallery\', вы увидете из снизу. Вы можете редактировать заголовки, описания и размер эскизов в администраторском разделе. Прочитайте про все возможности, которые предлагает этот модуль, в справке к модулю.';
$lang['message_wrongdir'] = 'Папка \'Gallery/%s\' не существует. Проверьте параметры.';
$lang['help_dir'] = 'Параметр задающий каталог относительно uploads/images/Gallery/';
$lang['help_template'] = 'Использовать шаблон из базы данных для вывода фотогалереи. Этот шаблон должен существовать и должен быть установлен как &quot;Видим в списке шаблонов&quot;, однако ему не обязательно быть выбранным по умолчанию. Если параметр не задан, то будет использоваться шаблон привязанный к каталогу (текущей субгалерее), или  если он не задан, то шаблон по умолчанию.';
$lang['help_targetpage'] = 'Страница для вывода Gallery. Это может быть и алиас(alias) и идентификатор(id) страницы. Предназанчено для вывода Gallery с другим шаблоном.';
$lang['help_number'] = 'Максимальное количество эскизов (на одну страницу). Если оставить пустым показывает все изображения.';
$lang['help_start'] = 'Начать вывод с н-го изображения. Оставьте пустым для вывода с первого изображения.';
$lang['help_show'] = 'Определяет какие изображения будут отображены. Возможные значения:
<ul>
<li>\'active\' - только активные изображения(по умолчанию)</li>
<li>\'inactive\' - только изображения помеченные как неактивные </li>
<li>\'all\' - отображает все изображения</li>
</ul>';
$lang['help_action'] = 'Переопределяет действие (action) по умолчанию. Комбинируйте с перечисленными выше параметрами. Допустимые значения:
<ul>
<li>\'showrandom\' - для отображения случайного набора эскизов изображений (работает только для изображений хранящихся в базе данных, по умолчанию выводит 6 изображений). Используйте \'/*\' после названия каталога в параметре &quot;dir&quot; для того чтобы включить изображения из субгалерей</li>
<li>\'showlatest\' - для отображения самых последних добавленных изображений (работает только для изображений хранящихся в базе данных, по умолчанию выводит 6 изображений). Может быть задан параметр dir, или будет использована корневая директория Gallery. Содержимое субгалерей включается автоматически.</li>
<li>\'showlatestdir\' - для отображения случайного набора эскизов изображений из последней добавленной директории (субгалереи) (работает только для изображений хранящихся в базе данных, по умолчанию выводит 6 изображений)</li>
<li>\'gallerytree\' - выводит ссылки на все галереи и субгалереи. По умолчанию используется шаблон gallerytree, однако это можно изменить используя параметр &quot;template&quot;. Используйте параметр dir для вывода части дерева галереи (subset of the gallerytree). (применимо только для галерей хранящихся в базе данных)</li>
</ul>
Обратите внимание, что изображения хранятся в базе данных только когда определенная галерея посещается в админ-интерфейсе или во фронтенде.';
$lang['help_loadcustomfields'] = 'Только для использования с action = \'gallerytree\'. Установите для этого параметра значение 1, если вы хотите использовать настраиваемые поля в шаблоне дерева галереи.';
$lang['help_img'] = 'Для вывода одного изображения используйте <code>{Gallery img=123}</code>. Разметка выводимого html может быть отредактирована во вкладке шаблоны. Размер эскизов изображений и JavaScript для них может быть установлен с помощью выбора шаблона в выпадающем списке.';
$lang['ga'] = 'GA1.2.782912386.1611333621';
$lang['gid'] = 'GA1.2.1051856980.1611949604';
?>